app/controllers/bedroms_controller.rb

  def index
    @bedroms = Bedrom.all
---
SELECT `bedroms`.* FROM `bedroms`