app/controllers/floors_controller.rb

  def index
    @floors = Floor.all
---
SELECT `floors`.* FROM `floors`